{"pageProps":{"postData":{"id":"a-digital-tool-checklist","contentHtml":"\n# A Digital Tool Checklist\n\nThis is my checklist for considering a digital tool.\n\n## It should be as fast as my fingers.\n\nI love snappy software. Tools should be fast to launch, search, and use. See: [Fast software, the best software](https://craigmod.com/essays/fast_software/)\n\n## It should be built with the right tools.\n\nUse the right tool for the right job. If it's built once for everywhere it will be slow or violate platform conventions.\n\n## It should allow me to own my information locally.\n\nI'd like full control over my data, regardless of wifi connection or server status. See: [Local-first software](https://www.inkandswitch.com/local-first.html)\n\n## It should be well crafted visually.\n\nAt the very least, visually palatable. So many good developer tools are hampered here. They are fast and powerful, but hard to look at.\n\n## It should have a well designed icon.\n\nThe app icon is a signal of app quality. An opportunity to go above and beyond.\n\n## I should be able to buy it.\n\nI don't like renting tools, and I'm suspicious of free ones. If I like it, I'd like to own it.\n\n## Data should be portable.\n\nNo lock-ins. Software comes and goes. The data should persist.\n\n## It should have first class keyboard support.\n\nThe alternative is carpal tunnel. If it can be done with the keyboard, it should be possible with the keyboard.\n\n## It should help me stay focused.\n\nIf there are updates or notifications, let me discover them when it's convenient for me. Another reason I'd prefer native over web. Native has a dedicated space. The browser is a distraction war zone.\n\n## It should be built on all relevant platforms.\n\nAnd take advantage of platform strengths.\n\n## It should teach skills/principles that outlive the tool.\n\nExamples include Todo apps that teach GTD. Writing apps that train your focus.\n\n## The Tools I love to Use\n\nShoutout to the product teams, and indie creators who are building tools for professionals.\nBelow are some of the tools I love to use.\n\n[Things](https://culturedcode.com/things/)  \n[iA Writer](https://ia.net/writer)  \n[Focus](https://heyfocus.com/)  \n[Fantastical](https://flexibits.com/fantastical)  \n[Keyboard Maestro](https://www.keyboardmaestro.com/main/)  \n[Sketch](https://www.sketch.com/)  \n[Bartender](https://www.macbartender.com/)  \n[VSCode](https://code.visualstudio.com/)  \n[1Password](https://1password.com/)  \n[iBooks](https://apps.apple.com/us/app/apple-books/id364709193)\n","title":"A Digital Tool Checklist","date":"2020-11-13","image":"https://res.cloudinary.com/dpgzvne4j/image/upload/v1605364416/a-digital-tool-checklist_nta21b.png"}},"__N_SSG":true}